tterho/ba8/3rdparty/SDK_2.7.0_MKL17Z256xxx4/devices/MKL43Z4/cmsis_drivers/fsl_uart_cmsis.c
uart_dma_handle_t UART3_DmaHandle;
dma_handle_t UART3_DmaRxHandle;
dma_handle_t UART3_DmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("uart3_dma_driver_state")
cmsis_uart_dma_driver_state_t uart3_DmaDriverState = {
#else
cmsis_uart_dma_driver_state_t uart3_DmaDriverState = {
#endif
    &uart3_Resource, &uart3_DmaResource, &UART3_DmaHandle, &UART3_DmaRxHandle, &UART3_DmaTxHandle};

static int32_t UART3_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
    UART3_InitPins();
    return UART_DmaInitialize(cb_event, &uart3_DmaDriverState);
}

static int32_t UART3_DmaUninitialize(void)
{
    UART3_DeinitPins();
    return UART_DmaUninitialize(&uart3_DmaDriverState);
}

static int32_t UART3_DmaPowerControl(ARM_POWER_STATE state)
{
    return UART_DmaPowerControl(state, &uart3_DmaDriverState);

    static int32_t UART3_DmaSend(const void *data, uint32_t num)
    {
        return UART_DmaSend(data, num, &uart3_DmaDriverState);
    }

    static int32_t UART3_DmaReceive(void *data, uint32_t num)
    {
        return UART_DmaReceive(data, num, &uart3_DmaDriverState);
    }

    static int32_t UART3_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
    {
        return UART_DmaTransfer(data_out, data_in, num, &uart3_DmaDriverState);
    }

    static uint32_t UART3_DmaGetTxCount(void)
    {
        return UART_DmaGetTxCount(&uart3_DmaDriverState);
    }

    static uint32_t UART3_DmaGetRxCount(void)
    {
        return UART_DmaGetRxCount(&uart3_DmaDriverState);
    }

    static int32_t UART3_DmaControl(uint32_t control, uint32_t arg)
    {
        return UART_DmaControl(control, arg, &uart3_DmaDriverState);
    }

    static ARM_USART_STATUS UART3_DmaGetStatus(void)
    {
        return UART_DmaGetStatus(&uart3_DmaDriverState);
    }

#endif

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

    cmsis_uart_edma_resource_t uart3_EdmaResource = {
        RTE_USART3_DMA_TX_DMA_BASE, RTE_USART3_DMA_TX_CH, RTE_USART3_DMA_TX_DMAMUX_BASE, RTE_USART3_DMA_TX_PERI_SEL,

        RTE_USART3_DMA_RX_DMA_BASE, RTE_USART3_DMA_RX_CH, RTE_USART3_DMA_RX_DMAMUX_BASE, RTE_USART3_DMA_RX_PERI_SEL,
    };

    uart_edma_handle_t UART3_EdmaHandle;
    edma_handle_t UART3_EdmaRxHandle;
    edma_handle_t UART3_EdmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
    ARMCC_SECTION("uart3_edma_driver_state")
    cmsis_uart_edma_driver_state_t uart3_EdmaDriverState = {
#else
    cmsis_uart_edma_driver_state_t uart3_EdmaDriverState = {
#endif
        &uart3_Resource,
        &uart3_EdmaResource,
        &UART3_EdmaHandle,
        &UART3_EdmaRxHandle,
        &UART3_EdmaTxHandle,
    };

    static int32_t UART3_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
    {
        UART3_InitPins();
        return UART_EdmaInitialize(cb_event, &uart3_EdmaDriverState);
    }

    static int32_t UART3_EdmaUninitialize(void)
    {
        UART3_DeinitPins();
        return UART_EdmaUninitialize(&uart3_EdmaDriverState);
    }

    static int32_t UART3_EdmaPowerControl(ARM_POWER_STATE state)
    {
        return UART_EdmaPowerControl(state, &uart3_EdmaDriverState);
    }

    static int32_t UART3_EdmaSend(const void *data, uint32_t num)
    {
        return UART_EdmaSend(data, num, &uart3_EdmaDriverState);
    }

    static int32_t UART3_EdmaReceive(void *data, uint32_t num)
    {
        return UART_EdmaReceive(data, num, &uart3_EdmaDriverState);
    }

    static int32_t UART3_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
    {
        return UART_EdmaTransfer(data_out, data_in, num, &uart3_EdmaDriverState);
    }

    static uint32_t UART3_EdmaGetTxCount(void)
    {
        return UART_EdmaGetTxCount(&uart3_EdmaDriverState);
    }

    static uint32_t UART3_EdmaGetRxCount(void)
    {
        return UART_EdmaGetRxCount(&uart3_EdmaDriverState);
    }

    static int32_t UART3_EdmaControl(uint32_t control, uint32_t arg)
    {
        return UART_EdmaControl(control, arg, &uart3_EdmaDriverState);
    }

    static ARM_USART_STATUS UART3_EdmaGetStatus(void)
    {
        return UART_EdmaGetStatus(&uart3_EdmaDriverState);
    }

#endif

#else

uart_handle_t UART3_Handle;

#if defined(USART3_RX_BUFFER_ENABLE) && (USART3_RX_BUFFER_ENABLE == 1)
static uint8_t uart3_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("uart3_non_blocking_driver_state")
cmsis_uart_interrupt_driver_state_t uart3_NonBlockingDriverState = {
#else
cmsis_uart_interrupt_driver_state_t uart3_NonBlockingDriverState = {
#endif
    &uart3_Resource,
    &UART3_Handle,
};

static int32_t UART3_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
    UART3_InitPins();
    return UART_NonBlockingInitialize(cb_event, &uart3_NonBlockingDriverState);
}

static int32_t UART3_NonBlockingUninitialize(void)
{
    UART3_DeinitPins();
    return UART_NonBlockingUninitialize(&uart3_NonBlockingDriverState);
}

static int32_t UART3_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    uint32_t result;

    result = UART_NonBlockingPowerControl(state, &uart3_NonBlockingDriverState);
#if defined(USART3_RX_BUFFER_ENABLE) && (USART3_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (uart3_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        UART_TransferStartRingBuffer(uart3_NonBlockingDriverState.resource->base, uart3_NonBlockingDriverState.handle,
                                     uart3_rxRingBuffer, USART_RX_BUFFER_LEN);
    }
#endif

    return result;
}

static int32_t UART3_NonBlockingSend(const void *data, uint32_t num)
{
    return UART_NonBlockingSend(data, num, &uart3_NonBlockingDriverState);
}

static int32_t UART3_NonBlockingReceive(void *data, uint32_t num)
{
    return UART_NonBlockingReceive(data, num, &uart3_NonBlockingDriverState);
}

