tterho/ba8/3rdparty/SDK_2.7.0_MKL17Z256xxx4/devices/MKL43Z4/cmsis_drivers/fsl_uart_cmsis.c
static int32_t UART3_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return UART_NonBlockingTransfer(data_out, data_in, num, &uart3_NonBlockingDriverState);
}

static uint32_t UART3_NonBlockingGetTxCount(void)
{
    return UART_NonBlockingGetTxCount(&uart3_NonBlockingDriverState);
}

static uint32_t UART3_NonBlockingGetRxCount(void)
{
    return UART_NonBlockingGetRxCount(&uart3_NonBlockingDriverState);
}

static int32_t UART3_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = UART_NonBlockingControl(control, arg, &uart3_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }
    if (uart3_NonBlockingDriverState.handle->rxRingBuffer != NULL)
    {
        /* Enable the interrupt to accept the data when user need the ring buffer. */
        UART_EnableInterrupts(uart3_NonBlockingDriverState.resource->base, kUART_RxDataRegFullInterruptEnable |
                                                                               kUART_RxOverrunInterruptEnable |
                                                                               kUART_FramingErrorInterruptEnable);
        /* Enable parity error interrupt when parity mode is enable*/
        if (UART_C1_PE_MASK & uart3_NonBlockingDriverState.resource->base->C1)
        {
            UART_EnableInterrupts(uart3_NonBlockingDriverState.resource->base, kUART_ParityErrorInterruptEnable);
        }
    }
    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS UART3_NonBlockingGetStatus(void)
{
    return UART_NonBlockingGetStatus(&uart3_NonBlockingDriverState);
}

#endif

    ARM_DRIVER_USART Driver_USART3 = {
        UARTx_GetVersion,
        UARTx_GetCapabilities,
#if RTE_USART3_DMA_EN
#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
        UART3_EdmaInitialize,
        UART3_EdmaUninitialize,
        UART3_EdmaPowerControl,
        UART3_EdmaSend,
        UART3_EdmaReceive,
        UART3_EdmaTransfer,
        UART3_EdmaGetTxCount,
        UART3_EdmaGetRxCount,
        UART3_EdmaControl,
        UART3_EdmaGetStatus,
#else
    UART3_DmaInitialize,
    UART3_DmaUninitialize,
    UART3_DmaPowerControl,
    UART3_DmaSend,
    UART3_DmaReceive,
    UART3_DmaTransfer,
    UART3_DmaGetTxCount,
    UART3_DmaGetRxCount,
    UART3_DmaControl,
    UART3_DmaGetStatus,
#endif
#else
    UART3_NonBlockingInitialize,
    UART3_NonBlockingUninitialize,
    UART3_NonBlockingPowerControl,
    UART3_NonBlockingSend,
    UART3_NonBlockingReceive,
    UART3_NonBlockingTransfer,
    UART3_NonBlockingGetTxCount,
    UART3_NonBlockingGetRxCount,
    UART3_NonBlockingControl,
    UART3_NonBlockingGetStatus,
#endif
        UARTx_SetModemControl,
        UARTx_GetModemStatus
    };

#endif /* uart3 */

#if defined(UART4) && RTE_USART4

    extern uint32_t UART4_GetFreq(void);
    extern void UART4_InitPins(void);
    extern void UART4_DeinitPins(void);

    cmsis_uart_resource_t uart4_Resource = {UART4, UART4_GetFreq};

#if RTE_USART4_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

    cmsis_uart_dma_resource_t uart4_DmaResource = {
        RTE_USART4_DMA_TX_DMA_BASE, RTE_USART4_DMA_TX_CH, RTE_USART4_DMA_TX_DMAMUX_BASE, RTE_USART4_DMA_TX_PERI_SEL,

        RTE_USART4_DMA_RX_DMA_BASE, RTE_USART4_DMA_RX_CH, RTE_USART4_DMA_RX_DMAMUX_BASE, RTE_USART4_DMA_RX_PERI_SEL,
    };

    uart_dma_handle_t UART4_DmaHandle;
    dma_handle_t UART4_DmaRxHandle;
    dma_handle_t UART4_DmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
    ARMCC_SECTION("uart4_dma_driver_state")
    cmsis_uart_dma_driver_state_t uart4_DmaDriverState = {
#else
    cmsis_uart_dma_driver_state_t uart4_DmaDriverState = {
#endif
        &uart4_Resource,
        &uart4_DmaResource,
        &UART4_DmaHandle,
        &UART4_DmaRxHandle,
        &UART4_DmaTxHandle,
    };

    static int32_t UART4_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
    {
        UART4_InitPins();
        return UART_DmaInitialize(cb_event, &uart4_DmaDriverState);
    }

    static int32_t UART4_DmaUninitialize(void)
    {
        UART4_DeinitPins();
        return UART_DmaUninitialize(&uart4_DmaDriverState);
    }

    static int32_t UART4_DmaPowerControl(ARM_POWER_STATE state)
    {
        return UART_DmaPowerControl(state, &uart4_DmaDriverState);
    }

    static int32_t UART4_DmaSend(const void *data, uint32_t num)
    {
        return UART_DmaSend(data, num, &uart4_DmaDriverState);
    }

    static int32_t UART4_DmaReceive(void *data, uint32_t num)
    {
        return UART_DmaReceive(data, num, &uart4_DmaDriverState);
    }

    static int32_t UART4_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
    {
        return UART_DmaTransfer(data_out, data_in, num, &uart4_DmaDriverState);
    }

    static uint32_t UART4_DmaGetTxCount(void)
    {
        return UART_DmaGetTxCount(&uart4_DmaDriverState);
    }

    static uint32_t UART4_DmaGetRxCount(void)
    {
        return UART_DmaGetRxCount(&uart4_DmaDriverState);
    }

    static int32_t UART4_DmaControl(uint32_t control, uint32_t arg)
    {
        return UART_DmaControl(control, arg, &uart4_DmaDriverState);
    }

    static ARM_USART_STATUS UART4_DmaGetStatus(void)
    {
        return UART_DmaGetStatus(&uart4_DmaDriverState);
    }

#endif

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

    cmsis_uart_edma_resource_t uart4_EdmaResource = {
        RTE_USART4_DMA_TX_DMA_BASE, RTE_USART4_DMA_TX_CH, RTE_USART4_DMA_TX_DMAMUX_BASE, RTE_USART4_DMA_TX_PERI_SEL,

        RTE_USART4_DMA_RX_DMA_BASE, RTE_USART4_DMA_RX_CH, RTE_USART4_DMA_RX_DMAMUX_BASE, RTE_USART4_DMA_RX_PERI_SEL,
    };

    uart_edma_handle_t UART4_EdmaHandle;
    edma_handle_t UART4_EdmaRxHandle;
    edma_handle_t UART4_EdmaTxHandle;

