tterho/ba8/3rdparty/SDK_2.7.0_MKL17Z256xxx4/devices/MKL43Z4/cmsis_drivers/fsl_uart_cmsis.c
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
    ARMCC_SECTION("uart4_edma_driver_state")
    cmsis_uart_edma_driver_state_t uart4_EdmaDriverState = {
#else
    cmsis_uart_edma_driver_state_t uart4_EdmaDriverState = {
#endif
        &uart4_Resource,
        &uart4_EdmaResource,
        &UART4_EdmaHandle,
        &UART4_EdmaRxHandle,
        &UART4_EdmaTxHandle,
    };

    static int32_t UART4_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
    {
        UART4_InitPins();
        return UART_EdmaInitialize(cb_event, &uart4_EdmaDriverState);
    }

    static int32_t UART4_EdmaUninitialize(void)
    {
        UART4_DeinitPins();
        return UART_EdmaUninitialize(&uart4_EdmaDriverState);
    }

    static int32_t UART4_EdmaPowerControl(ARM_POWER_STATE state)
    {
        return UART_EdmaPowerControl(state, &uart4_EdmaDriverState);
    }

    static int32_t UART4_EdmaSend(const void *data, uint32_t num)
    {
        return UART_EdmaSend(data, num, &uart4_EdmaDriverState);
    }

    static int32_t UART4_EdmaReceive(void *data, uint32_t num)
    {
        return UART_EdmaReceive(data, num, &uart4_EdmaDriverState);
    }

    static int32_t UART4_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
    {
        return UART_EdmaTransfer(data_out, data_in, num, &uart4_EdmaDriverState);
    }

    static uint32_t UART4_EdmaGetTxCount(void)
    {
        return UART_EdmaGetTxCount(&uart4_EdmaDriverState);
    }

    static uint32_t UART4_EdmaGetRxCount(void)
    {
        return UART_EdmaGetRxCount(&uart4_EdmaDriverState);
    }

    static int32_t UART4_EdmaControl(uint32_t control, uint32_t arg)
    {
        return UART_EdmaControl(control, arg, &uart4_EdmaDriverState);
    }

    static ARM_USART_STATUS UART4_EdmaGetStatus(void)
    {
        return UART_EdmaGetStatus(&uart4_EdmaDriverState);
    }

#endif

#else

uart_handle_t UART4_Handle;

#if defined(USART4_RX_BUFFER_ENABLE) && (USART4_RX_BUFFER_ENABLE == 1)
static uint8_t uart4_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("uart4_non_blocking_driver_state")
cmsis_uart_interrupt_driver_state_t uart4_NonBlockingDriverState = {
#else
cmsis_uart_interrupt_driver_state_t uart4_NonBlockingDriverState = {
#endif
    &uart4_Resource,
    &UART4_Handle,
};

static int32_t UART4_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
    UART4_InitPins();
    return UART_NonBlockingInitialize(cb_event, &uart4_NonBlockingDriverState);
}

static int32_t UART4_NonBlockingUninitialize(void)
{
    UART4_DeinitPins();
    return UART_NonBlockingUninitialize(&uart4_NonBlockingDriverState);
}

static int32_t UART4_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    uint32_t result;

    result = UART_NonBlockingPowerControl(state, &uart4_NonBlockingDriverState);
#if defined(USART4_RX_BUFFER_ENABLE) && (USART4_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (uart4_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        UART_TransferStartRingBuffer(uart4_NonBlockingDriverState.resource->base, uart4_NonBlockingDriverState.handle,
                                     uart4_rxRingBuffer, USART_RX_BUFFER_LEN);
    }
#endif

    return result;
}

static int32_t UART4_NonBlockingSend(const void *data, uint32_t num)
{
    return UART_NonBlockingSend(data, num, &uart4_NonBlockingDriverState);
}

static int32_t UART4_NonBlockingReceive(void *data, uint32_t num)
{
    return UART_NonBlockingReceive(data, num, &uart4_NonBlockingDriverState);
}

static int32_t UART4_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return UART_NonBlockingTransfer(data_out, data_in, num, &uart4_NonBlockingDriverState);
}

static uint32_t UART4_NonBlockingGetTxCount(void)
{
    return UART_NonBlockingGetTxCount(&uart4_NonBlockingDriverState);
}

static uint32_t UART4_NonBlockingGetRxCount(void)
{
    return UART_NonBlockingGetRxCount(&uart4_NonBlockingDriverState);
}

static int32_t UART4_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = UART_NonBlockingControl(control, arg, &uart4_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }
    if (uart4_NonBlockingDriverState.handle->rxRingBuffer != NULL)
    {
        /* Enable the interrupt to accept the data when user need the ring buffer. */
        UART_EnableInterrupts(uart4_NonBlockingDriverState.resource->base, kUART_RxDataRegFullInterruptEnable |
                                                                               kUART_RxOverrunInterruptEnable |
                                                                               kUART_FramingErrorInterruptEnable);
        /* Enable parity error interrupt when parity mode is enable*/
        if (UART_C1_PE_MASK & uart4_NonBlockingDriverState.resource->base->C1)
        {
            UART_EnableInterrupts(uart4_NonBlockingDriverState.resource->base, kUART_ParityErrorInterruptEnable);
        }
    }
    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS UART4_NonBlockingGetStatus(void)
{
    return UART_NonBlockingGetStatus(&uart4_NonBlockingDriverState);
}

#endif

    ARM_DRIVER_USART Driver_USART4 = {
        UARTx_GetVersion,
        UARTx_GetCapabilities,
#if RTE_USART4_DMA_EN
#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
        UART4_EdmaInitialize,
        UART4_EdmaUninitialize,
        UART4_EdmaPowerControl,
        UART4_EdmaSend,
        UART4_EdmaReceive,
        UART4_EdmaTransfer,
        UART4_EdmaGetTxCount,
        UART4_EdmaGetRxCount,
        UART4_EdmaControl,
        UART4_EdmaGetStatus,
#else
    UART4_DmaInitialize,
    UART4_DmaUninitialize,
    UART4_DmaPowerControl,
    UART4_DmaSend,
    UART4_DmaReceive,
    UART4_DmaTransfer,
    UART4_DmaGetTxCount,
    UART4_DmaGetRxCount,
    UART4_DmaControl,
    UART4_DmaGetStatus,
#endif
#else
    UART4_NonBlockingInitialize,
    UART4_NonBlockingUninitialize,
    UART4_NonBlockingPowerControl,
    UART4_NonBlockingSend,
    UART4_NonBlockingReceive,
    UART4_NonBlockingTransfer,
    UART4_NonBlockingGetTxCount,
    UART4_NonBlockingGetRxCount,
    UART4_NonBlockingControl,
    UART4_NonBlockingGetStatus,
#endif
        UARTx_SetModemControl,
        UARTx_GetModemStatus
    };

#endif /* uart4 */

