tterho/ba8/3rdparty/SDK_2.7.0_MKL17Z256xxx4/devices/MKL43Z4/cmsis_drivers/fsl_uart_cmsis.c
#if defined(UART5) && RTE_USART5

    extern uint32_t UART5_GetFreq(void);
    extern void UART5_InitPins(void);
    extern void UART5_DeinitPins(void);

    cmsis_uart_resource_t uart5_Resource = {UART5, UART5_GetFreq};

#if RTE_USART5_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

    cmsis_uart_dma_resource_t uart5_DmaResource = {
        RTE_USART5_DMA_TX_DMA_BASE, RTE_USART5_DMA_TX_CH, RTE_USART5_DMA_TX_DMAMUX_BASE, RTE_USART5_DMA_TX_PERI_SEL,

        RTE_USART5_DMA_RX_DMA_BASE, RTE_USART5_DMA_RX_CH, RTE_USART5_DMA_RX_DMAMUX_BASE, RTE_USART5_DMA_RX_PERI_SEL,
    };

    uart_dma_handle_t UART5_DmaHandle;
    dma_handle_t UART5_DmaRxHandle;
    dma_handle_t UART5_DmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
    ARMCC_SECTION("uart5_dma_driver_state")
    cmsis_uart_dma_driver_state_t uart5_DmaDriverState = {
#else
    cmsis_uart_dma_driver_state_t uart5_DmaDriverState = {
#endif
        &uart5_Resource,
        &uart5_DmaResource,
        &UART5_DmaHandle,
        &UART5_DmaRxHandle,
        UART5_DmaTxHandle,
    };

    static int32_t UART5_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
    {
        UART5_InitPins();
        return UART_DmaInitialize(cb_event, &uart5_DmaDriverState);
    }

    static int32_t UART5_DmaUninitialize(void)
    {
        UART5_DeinitPins();
        return UART_DmaUninitialize(&uart5_DmaDriverState);
    }

    static int32_t UART5_DmaPowerControl(ARM_POWER_STATE state)
    {
        return UART_DmaPowerControl(state, &uart5_DmaDriverState);
    }

    static int32_t UART5_DmaSend(const void *data, uint32_t num)
    {
        return UART_DmaSend(data, num, &uart5_DmaDriverState);
    }

    static int32_t UART5_DmaReceive(void *data, uint32_t num)
    {
        return UART_DmaReceive(data, num, &uart5_DmaDriverState);
    }

    static int32_t UART5_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
    {
        return UART_DmaTransfer(data_out, data_in, num, &uart5_DmaDriverState);
    }

    static uint32_t UART5_DmaGetTxCount(void)
    {
        return UART_DmaGetTxCount(&uart5_DmaDriverState);
    }

    static uint32_t UART5_DmaGetRxCount(void)
    {
        return UART_DmaGetRxCount(&uart5_DmaDriverState);
    }

    static int32_t UART5_DmaControl(uint32_t control, uint32_t arg)
    {
        return UART_DmaControl(control, arg, &uart5_DmaDriverState);
    }

    static ARM_USART_STATUS UART5_DmaGetStatus(void)
    {
        return UART_DmaGetStatus(&uart5_DmaDriverState);
    }

#endif

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

    cmsis_uart_edma_resource_t uart5_EdmaResource = {
        RTE_USART5_DMA_TX_DMA_BASE, RTE_USART5_DMA_TX_CH, RTE_USART5_DMA_TX_DMAMUX_BASE, RTE_USART5_DMA_TX_PERI_SEL,

        RTE_USART5_DMA_RX_DMA_BASE, RTE_USART5_DMA_RX_CH, RTE_USART5_DMA_RX_DMAMUX_BASE, RTE_USART5_DMA_RX_PERI_SEL,
    };

    uart_edma_handle_t UART5_EdmaHandle;
    edma_handle_t UART5_EdmaRxHandle;
    edma_handle_t UART5_EdmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
    ARMCC_SECTION("uart5_edma_driver_state")
    cmsis_uart_edma_driver_state_t uart5_EdmaDriverState = {
#else
    cmsis_uart_edma_driver_state_t uart5_EdmaDriverState = {
#endif
        &uart5_Resource,
        &uart5_EdmaResource,
        &UART5_EdmaHandle,
        &UART5_EdmaRxHandle,
        &UART5_EdmaTxHandle,
    };

    static int32_t UART5_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
    {
        UART5_InitPins();
        return UART_EdmaInitialize(cb_event, &uart5_EdmaDriverState);
    }

    static int32_t UART5_EdmaUninitialize(void)
    {
        UART5_DeinitPins();
        return UART_EdmaUninitialize(&uart5_EdmaDriverState);
    }

    static int32_t UART5_EdmaPowerControl(ARM_POWER_STATE state)
    {
        return UART_EdmaPowerControl(state, &uart5_EdmaDriverState);
    }

    static int32_t UART5_EdmaSend(const void *data, uint32_t num)
    {
        return UART_EdmaSend(data, num, &uart5_EdmaDriverState);
    }

    static int32_t UART5_EdmaReceive(void *data, uint32_t num)
    {
        return UART_EdmaReceive(data, num, &uart5_EdmaDriverState);
    }

    static int32_t UART5_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
    {
        return UART_EdmaTransfer(data_out, data_in, num, &uart5_EdmaDriverState);
    }

    static uint32_t UART5_EdmaGetTxCount(void)
    {
        return UART_EdmaGetTxCount(&uart5_EdmaDriverState);
    }

    static uint32_t UART5_EdmaGetRxCount(void)
    {
        return UART_EdmaGetRxCount(&uart5_EdmaDriverState);
    }

    static int32_t UART5_EdmaControl(uint32_t control, uint32_t arg)
    {
        return UART_EdmaControl(control, arg, &uart5_EdmaDriverState);
    }

    static ARM_USART_STATUS UART5_EdmaGetStatus(void)
    {
        return UART_EdmaGetStatus(&uart5_EdmaDriverState);
    }

#endif

#else

uart_handle_t UART5_Handle;

#if defined(USART5_RX_BUFFER_ENABLE) && (USART5_RX_BUFFER_ENABLE == 1)
static uint8_t uart5_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("uart5_non_blocking_driver_state")
cmsis_uart_interrupt_driver_state_t uart5_NonBlockingDriverState = {
#else
cmsis_uart_interrupt_driver_state_t uart5_NonBlockingDriverState = {
#endif
    &uart5_Resource,
    &UART5_Handle,
};

static int32_t UART5_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
    UART5_InitPins();
    return UART_NonBlockingInitialize(cb_event, &uart5_NonBlockingDriverState);
}

static int32_t UART5_NonBlockingUninitialize(void)
{
    UART5_DeinitPins();
    return UART_NonBlockingUninitialize(&uart5_NonBlockingDriverState);
}

static int32_t UART5_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    uint32_t result;

    result = UART_NonBlockingPowerControl(state, &uart5_NonBlockingDriverState);
#if defined(USART5_RX_BUFFER_ENABLE) && (USART5_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (uart5_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        UART_TransferStartRingBuffer(uart5_NonBlockingDriverState.resource->base, uart5_NonBlockingDriverState.handle,
                                     uart5_rxRingBuffer, USART_RX_BUFFER_LEN);
    }
#endif

    return result;
}

