tterho/ba8/3rdparty/SDK_2.7.0_MKL17Z256xxx4/devices/MKL43Z4/cmsis_drivers/fsl_uart_cmsis.c
static int32_t UART5_NonBlockingSend(const void *data, uint32_t num)
{
    return UART_NonBlockingSend(data, num, &uart5_NonBlockingDriverState);
}

static int32_t UART5_NonBlockingReceive(void *data, uint32_t num)
{
    return UART_NonBlockingReceive(data, num, &uart5_NonBlockingDriverState);
}

static int32_t UART5_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return UART_NonBlockingTransfer(data_out, data_in, num, &uart5_NonBlockingDriverState);
}

static uint32_t UART5_NonBlockingGetTxCount(void)
{
    return UART_NonBlockingGetTxCount(&uart5_NonBlockingDriverState);
}

static uint32_t UART5_NonBlockingGetRxCount(void)
{
    return UART_NonBlockingGetRxCount(&uart5_NonBlockingDriverState);
}

static int32_t UART5_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = UART_NonBlockingControl(control, arg, &uart5_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }
    if (uart5_NonBlockingDriverState.handle->rxRingBuffer != NULL)
    {
        /* Enable the interrupt to accept the data when user need the ring buffer. */
        UART_EnableInterrupts(uart5_NonBlockingDriverState.resource->base, kUART_RxDataRegFullInterruptEnable |
                                                                               kUART_RxOverrunInterruptEnable |
                                                                               kUART_FramingErrorInterruptEnable);
        /* Enable parity error interrupt when parity mode is enable*/
        if (UART_C1_PE_MASK & uart5_NonBlockingDriverState.resource->base->C1)
        {
            UART_EnableInterrupts(uart5_NonBlockingDriverState.resource->base, kUART_ParityErrorInterruptEnable);
        }
    }
    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS UART5_NonBlockingGetStatus(void)
{
    return UART_NonBlockingGetStatus(&uart5_NonBlockingDriverState);
}

#endif

    ARM_DRIVER_USART Driver_USART5 = {
        UARTx_GetVersion,
        UARTx_GetCapabilities,
#if RTE_USART5_DMA_EN
#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
        UART5_EdmaInitialize,
        UART5_EdmaUninitialize,
        UART5_EdmaPowerControl,
        UART5_EdmaSend,
        UART5_EdmaReceive,
        UART5_EdmaTransfer,
        UART5_EdmaGetTxCount,
        UART5_EdmaGetRxCount,
        UART5_EdmaControl,
        UART5_EdmaGetStatus,
#else
    UART5_DmaInitialize,
    UART5_DmaUninitialize,
    UART5_DmaPowerControl,
    UART5_DmaSend,
    UART5_DmaReceive,
    UART5_DmaTransfer,
    UART5_DmaGetTxCount,
    UART5_DmaGetRxCount,
    UART5_DmaControl,
    UART5_DmaGetStatus,
#endif
#else
    UART5_NonBlockingInitialize,
    UART5_NonBlockingUninitialize,
    UART5_NonBlockingPowerControl,
    UART5_NonBlockingSend,
    UART5_NonBlockingReceive,
    UART5_NonBlockingTransfer,
    UART5_NonBlockingGetTxCount,
    UART5_NonBlockingGetRxCount,
    UART5_NonBlockingControl,
    UART5_NonBlockingGetStatus,
#endif
        UARTx_SetModemControl,
        UARTx_GetModemStatus
    };

#endif /* uart5 */
